---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RegenFailures.CannotRegenFamily
source: html/cf65bf85-0c0a-65a5-edfe-9aacf3eac3a2.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RegenFailures.CannotRegenFamily Property

Can't regenerate Family [Family Name]. Edit Family to modify it.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotRegenFamily { get; }
```